
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7357100312)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_compute_instance_group_manager.minecraft_group
  * google_compute_instance_template.minecraft_template


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_compute_instance_group_manager.minecraft_group will be created
  + resource "google_compute_instance_group_manager" "minecraft_group" {
      + base_instance_name             = "minecraft"
      + fingerprint                    = (known after apply)
      + id                             = (known after apply)
      + instance_group                 = (known after apply)
      + list_managed_instances_results = "PAGELESS"
      + name                           = "minecraft-group"
      + operation                      = (known after apply)
      + project                        = "bakatare-minecraft"
      + self_link                      = (known after apply)
      + status                         = (known after apply)
      + target_size                    = 1
      + wait_for_instances             = false
      + wait_for_instances_status      = "STABLE"
      + zone                           = "us-central1-a"

      + version {
          + instance_template = (known after apply)
        }
      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_template.minecraft_template will be created
  + resource "google_compute_instance_template" "minecraft_template" {
      + can_ip_forward          = false
      + effective_labels        = (known after apply)
      + id                      = (known after apply)
      + machine_type            = "t2a-standard-4"
      + metadata                = {
          + "enable-oslogin"  = "TRUE"
          + "shutdown-script" = <<-EOT
                #!/bin/bash
                cd ~/bakatare-minna/docker && docker compose exec mc rcon-cli 王道注意
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            INSTANCE_NAME=$(curl "http://metadata.google.internal/computeMetadata/v1/instance/name" -H "Metadata-Flavor: Google")
            
            # 新しいディスクを確認し、存在する場合はフォーマットしてマウントする!!!
            FS_TYPE="ext4"
            DISK="/dev/disk/by-id/google-minecraft"
            MOUNT_POINT="/mnt/stateful_partition/minecraft"
            
            gcloud compute instances attach-disk $$INSTANCE_NAME \
              --disk projects/bakatare-minecraft/zones/us-central1-a/disks/world-data \
              --zone us-central1-a \
              --device-name minecraft \
              --mode rw
            
            # デバイスが現れるまで待つ
            while [ ! -e $DISK ]; do
              echo "Waiting for $DEVICE to be attached"
              sleep 1
            done
            
            # マウントポイントを作成
            mkdir -p "${MOUNT_POINT}"
            
            # ディスクがフォーマットされているか確認
            if ! blkid "${DISK}" > /dev/null 2>&1; then
                echo "Formatting disk ${DISK}"
                # ディスクをフォーマット
                mkfs.ext4 -F "${DISK}"
            fi
            
            # ディスクをマウント
            echo "Mounting disk ${DISK} at ${MOUNT_POINT}"
            mount -t "${FS_TYPE}" "${DISK}" "${MOUNT_POINT}"
            
            # 自動マウントの設定
            if ! grep -qs "${MOUNT_POINT} " /etc/fstab; then
                echo "Adding ${MOUNT_POINT} to /etc/fstab"
                echo "${DISK} ${MOUNT_POINT} ${FS_TYPE} defaults 0 2" >> /etc/fstab
            fi
            
            apt-get update -y
            apt-get install -y apt-transport-https ca-certificates curl software-properties-common
            curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
            add-apt-repository "deb [arch=arm64] https://download.docker.com/linux/ubuntu focal stable"
            apt-get install -y docker-ce
            apt-get install docker-compose-plugin
            systemctl start docker
            systemctl enable docker
            
            git clone https://github.com/naari3/bakatare-minna ~/bakatare-minna
            cd ~/bakatare-minna/docker
            docker compose up -d
        EOT
      + name                    = (known after apply)
      + name_prefix             = "minecraft-template-"
      + project                 = "bakatare-minecraft"
      + region                  = "us-central1"
      + self_link               = (known after apply)
      + self_link_unique        = (known after apply)
      + tags                    = [
          + "minecraft",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = (known after apply)

      + disk {
          + auto_delete      = true
          + boot             = true
          + device_name      = (known after apply)
          + disk_size_gb     = 10
          + disk_type        = "pd-standard"
          + interface        = (known after apply)
          + mode             = (known after apply)
          + provisioned_iops = (known after apply)
          + source_image     = "projects/ubuntu-os-cloud/global/images/family/ubuntu-2204-lts-arm64"
          + type             = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "minecraft"
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip                 = "34.42.86.231"
              + network_tier           = (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
          + provisioning_model  = (known after apply)
        }

      + service_account {
          + email  = "bakatare@bakatare-minecraft.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/userinfo.email",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":43,"Program":"tfcmt","SHA1":"a0aef3cdfee4c3c92ef0c45f45a087556ef23b1f","Target":"terraform","Vars":{},"WorkflowName":"test"} -->